# my_list = [[1, 2, 3, 5], [7, 346, 235, 235], 347, -435, -23, 0]

# print(my_list[1][1])
# print(my_list[1][1:3])
# print(len(my_list[1]))



# my_list = [1, 2, 3, 5, 7, 346, 235, 235, 347, -435, -23, 0]
# print(my_list[::-1]) #Зозвернев список  # [0, -23, -435, 347, 235, 235, 346, 7, 5, 3, 2, 1]
# print(my_list[-1]) #Індикс числа з кінця  # 0
# print(my_list[3::])   # Від фндукса 3 до 0 # [5, 7, 346, 235, 235, 347, -435, -23, 0]
# print(my_list[:6])  # [1, 2, 3, 5, 7, 346]
# print(my_list[2:10])  # [3, 5, 7, 346, 235, 235, 347, -435]
# print(my_list[:6:-1])  # [0, -23, -435, 347, 235]
# print(my_list[:])  # [1, 2, 3, 5, 7, 346, 235, 235, 347, -435, -23, 0]
# print(my_list[2:10:2]) # [3, 7, 235, 347]


#Polindron читаємо список з ліва на право
# old = [1, 2, 3]
# print(old == old[::-1])
# new = [2, 3, 2]
# print(new == new[::-1])

